[MemeWeapon_Bardiche]
WeaponName=Bardiche
WeaponDescription=An extremely long and powerful slashing polearm, the Bardiche is a fearsome weapon but must avoid getting into close lest the wielder be overwhelmed.

[MemeWeapon_Bearded]
WeaponName=Bearded Axe
WeaponDescription=The cutting edge of the Bearded Axe extends below the width of the butt to provide a wide cutting surface while keeping the overall weight of the axe low; this results in a well-balanced axe with good damage, speed and reach.

[MemeWeapon_Bill]
WeaponName=Billhook
WeaponDescription=The Billhook is a fearsome polearm that sacrifices a bit of range for significantly faster strikes.

[MemeWeapon_Brandistock]
WeaponName=Brandistock
WeaponDescription=The Brandistock is a three-pronged spear weapon capable of delivering massive damage with a thrust. Its weight and length leave it a somewhat slow to strike.

[MemeWeapon_BroadDagger]
WeaponName=Broad Dagger
WeaponDescription=The Broad Dagger is a very simple weapon, primarily designed to slash and cut the flesh of an enemy. Its broad base allows it to be very well-balanced, resulting in it being the quickest weapon to strike in the game.

[MemeWeapon_Broadsword]
WeaponName=Broadsword
WeaponDescription=The Broadsword is a very effective weapon, it is fairly quick and deals reasonable damage. A well-rounded sword.

[MemeWeapon_Claymore]
WeaponName=Claymore
WeaponDescription=The iconic Scottish Claymore is a long, sleek two-handed sword that strikes quickly for its size and with moderate damage.

[MemeWeapon_Cudgel]
WeaponName=Cudgel
WeaponDescription=One of the simplest weapons in the arsenal, a wooden club that is best used to overwhelm opponents up-close with blunt damage

[MemeWeapon_Dagesse]
WeaponName=Shortsword
WeaponDescription=The Shortsword is the classic archer's backup weapon, it is capable of delivering reasonable damage by slashing, hacking or thrusting upon opponents. A well balanced backup without many draw-backs.

[MemeWeapon_Dane]
WeaponName=Dane Axe
WeaponDescription=A one-handed weapon with considerable reach, the Dane Axe is reasonably damaging and somewhat slow to strike.

[MemeWeapon_DoubleAxe]
WeaponName=Double Axe
WeaponDescription=The Double Axe is a devastating weapon. This massive chopping damage comes at a price though: it is very heavy and thus slow to recover from strikes.

[MemeWeapon_Falchion]
WeaponName=Falchion
WeaponDescription=A single-edged curved sword that has considerable power and speed but limited reach.

[MemeWeapon_Flail]
WeaponName=Flail
WeaponDescription=The Flail is the least predictable of any weapon in the game. It has a mid to short range and is the fastest Knight weapon. It does reasonable damage but it is extremely hard to defend against.

[MemeWeapon_Fork]
WeaponName=Fork
WeaponDescription=The Fork is a shorter spear weapon with two long tines. Its reduced reach makes it faster to strike.

[MemeWeapon_GrandMace]
WeaponName=Grand Mace
WeaponDescription=The Grand Mace is a massive two-handed metal club that is well-balanced in its ability to deal heavy blunt damage at reasonable speed and reach.

[MemeWeapon_Greatsword]
WeaponName=Greatsword
WeaponDescription=As balanced as a two-handed sword can be, the Greatsword offers huge power and reach with only minor setbacks in speed.

[MemeWeapon_HFlail]
WeaponName=Heavy Flail
WeaponDescription=The Heavy Flail has the ability to deal massive crushing power while still being just as unpredictable as the normal Flail. It sacrifices speed for its power, but makes up for it in intimidation.

[MemeWeapon_Halberd]
WeaponName=Halberd
WeaponDescription=The halberd is primarily used as a stab weapon, though overhead strikes can deal significant damage as well due to the massive weight of the weapon.

[MemeWeapon_Hatchet]
WeaponName=Hatchet
WeaponDescription=The Hatchet is light and fast, allowing it to overwhelm opponents up-close with solid damage, although it suffers in reach.

[MemeWeapon_HolyWaterSprinkler]
WeaponName=Holy Water Sprinkler
WeaponDescription=A short club with spikes sticking out of it, the Holy Water Sprinkler is a modified mace weapon that strikes extremely quickly.

[MemeWeapon_HuntingKnife]
WeaponName=Hunting Knife
WeaponDescription=The Hunting Knife is incredibly fast to strike and has a great cutting ability, though it's not as effective with a thrust.

[MemeWeapon_Longsword]
WeaponName=Longsword
WeaponDescription=The Longsword can be wielded in one or two hands and is also known as a "Bastard Sword". It combines power, speed and reach to become one of the most well-rounded weapons.

[MemeWeapon_Mace]
WeaponName=Mace
WeaponDescription=The Flanged Mace is a deadly weapon that is best when used to overwhelm opponents with repeated strikes. It deals more damage than the Broadsword and is slightly faster, though its reach is considerably shorter.

[MemeWeapon_Maul]
WeaponName=Maul
WeaponDescription=The Maul is a modified sledgehammer, made more vicious for battle. It is the most damaging single strike melee weapon in the arsenal and also comes with considerable reach, although it is incredibly heavy and slow as a result.

[MemeWeapon_Messer]
WeaponName=Messer
WeaponDescription=A long hand and a half sword with a single cutting edge, the Messer is capable of dealing brutal horizontal and overhead strikes to an opponent but has a weaker stab.

[MemeWeapon_MorningStar]
WeaponName=Morning Star
WeaponDescription=The Morning Star is long-reaching mace weapon that deals a bit less damage and has a moderate rate of attack.

[MemeWeapon_NorseSword]
WeaponName=Norse Sword
WeaponDescription=A very fast dual-edged sword that has good reach and thrusts but limited cutting power.

[MemeWeapon_PickAxe]
WeaponName=Pick Axe
WeaponDescription=The Pick Axe is a devastating weapon. This penetrating damage comes at a price though: it is very heavy and thus slow to recover from strikes.

[MemeWeapon_PoleAxe]
WeaponName=Poleaxe
WeaponDescription=One of the most versatile weapons in the arsenal, the Poleaxe is capable of dispatching opponents with cut, blunt or piercing damage.

[MemeWeapon_PoleHammer]
WeaponName=Pole Hammer
WeaponDescription=A gruesome warhammer head atop a long pole make this weapon very effective in a variety of strikes and with great range while suffering slightly in the speed department.

[MemeWeapon_QuarterStaff]
WeaponName=Quarterstaff
WeaponDescription=The most unassuming weapon, a Quarterstaff is a thick piece of wood that in the right hands is capable of overwhelming any opponent with its speed and blunt damage.

[MemeWeapon_Saber]
WeaponName=Sabre
WeaponDescription=A light blade that is extremely quick to strike and with solid reach, the Sabre lacks the damage and stopping power of heavier weapons.

[MemeWeapon_Spear]
WeaponName=Spear
WeaponDescription=The Thrusting Spear has the advantage of reach, being considerably longer than any other weapon in the arsenal.

[MemeWeapon_SwordOfWar]
WeaponName=Sword of War
WeaponDescription=The Sword of War is a hand-and-a-half sword that offers a bit more speed for reduced damage

[MemeWeapon_ThrustDagger]
WeaponName=Thrusting Dagger
WeaponDescription=Sharp pointed dagger that is designed for thrusting. Due to its pointy tip it has the ability to penetrate almost any armour.

[MemeWeapon_WarAxe]
WeaponName=War Axe
WeaponDescription=The one-handed war axe is the Man-at-arm's most powerful single-strike weapon option. It trades some attack speed and reach as a result.

[MemeWeapon_WarHammer]
WeaponName=War Hammer
WeaponDescription=The War Hammer is a shorter ranged weapon that can pierce even the thickest of armour. It is extremely damaging, with modest range and speed.

[MemeWeapon_Zweihander]
WeaponName=Zweihander
WeaponDescription=A massive two-handed German sword with wavy blade that deals out extreme levels of punishment with heavy, slow swings.